In [88]:
import sqlite3
import pandas as pd

In [89]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [90]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [91]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [92]:
pd.read_sql(
    '''
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [93]:
tasks = 0

### Все задания нужно выполнить только с помощью sql

1. Выведите количество пустых значений по колонкам CRIM, ZN, INDUS, CHAS, NOX (название колонки, кол-во пустых значений)

In [94]:
tasks+=1
pd.read_sql(
    '''   
SELECT 'CRIM' AS Column_Name, COUNT(*) - COUNT(CRIM) AS Null_Count FROM boston
UNION ALL
SELECT 'ZN', COUNT(*) - COUNT(ZN) FROM boston
UNION ALL
SELECT 'INDUS', COUNT(*) - COUNT(INDUS) FROM boston
UNION ALL
SELECT 'CHAS', COUNT(*) - COUNT(CHAS) FROM boston
UNION ALL
SELECT 'NOX', COUNT(*) - COUNT(NOX) FROM boston;
    ''',
    con,
)

  Column_Name  Null_Count
0        CRIM           0
1          ZN           0
2       INDUS           0
3        CHAS           0
4         NOX           0

2. Выведите количество уникальных значений по колонокам CRIM, ZN, INDUS, CHAS, NOX (название колонки, кол-во уникальных значений)

In [95]:
tasks+=1
pd.read_sql(
    '''
SELECT 'CRIM' AS Column_Name, COUNT(DISTINCT CRIM) AS Unique_Count FROM boston
UNION ALL
SELECT 'ZN' AS Column_Name, COUNT(DISTINCT ZN) AS Unique_Count FROM boston
UNION ALL
SELECT 'INDUS' AS Column_Name, COUNT(DISTINCT INDUS) AS Unique_Count FROM boston
UNION ALL
SELECT 'CHAS' AS Column_Name, COUNT(DISTINCT CHAS) AS Unique_Count FROM boston
UNION ALL
SELECT 'NOX' AS Column_Name, COUNT(DISTINCT NOX) AS Unique_Count FROM boston;
    ''',
    con,
)

  Column_Name  Unique_Count
0        CRIM           504
1          ZN            26
2       INDUS            76
3        CHAS             2
4         NOX            81

3. Выведите колонки, у которых медиана равна минимальному значению (название колонки) выбирая из CRIM, ZN, INDUS, CHAS, NOX.
Напишите какой вывод можно сделать по данным в этих колонках

In [121]:
tasks+=1
pd.read_sql(
    '''   
WITH Ordered AS (
    SELECT CRIM,
           ROW_NUMBER() OVER (ORDER BY CRIM) AS rn,
           COUNT(*) OVER () AS cnt
    FROM boston
)
SELECT MIN(CRIM) as MinValue,
       MAX(CASE WHEN rn IN (cnt/2, cnt/2 + 1, (cnt + 1)/2) THEN CRIM END) as Median
FROM Ordered

 ''',
    con,
)

   MinValue   Median
0   0.00632  0.25915

In [124]:
tasks+=1
pd.read_sql(
    '''   
WITH Ordered AS (
    SELECT ZN,
           ROW_NUMBER() OVER (ORDER BY ZN) AS rn,
           COUNT(*) OVER () AS cnt
    FROM boston
)
SELECT MIN(ZN) as MinValue,
       MAX(CASE WHEN rn IN (cnt/2, cnt/2 + 1, (cnt + 1)/2) THEN ZN END) as Median
FROM Ordered

 ''',
    con,
)

   MinValue  Median
0       0.0     0.0

In [123]:
tasks+=1
pd.read_sql(
    '''   
WITH Ordered AS (
    SELECT INDUS,
           ROW_NUMBER() OVER (ORDER BY INDUS) AS rn,
           COUNT(*) OVER () AS cnt
    FROM boston
)
SELECT MIN(INDUS) as MinValue,
       MAX(CASE WHEN rn IN (cnt/2, cnt/2 + 1, (cnt + 1)/2) THEN INDUS END) as Median
FROM Ordered

 ''',
    con,
)

   MinValue  Median
0      0.46    9.69

In [125]:
tasks+=1
pd.read_sql(
    '''   
WITH Ordered AS (
    SELECT CHAS,
           ROW_NUMBER() OVER (ORDER BY CHAS) AS rn,
           COUNT(*) OVER () AS cnt
    FROM boston
)
SELECT MIN(CHAS) as MinValue,
       MAX(CASE WHEN rn IN (cnt/2, cnt/2 + 1, (cnt + 1)/2) THEN CHAS END) as Median
FROM Ordered

 ''',
    con,
)

   MinValue  Median
0       0.0     0.0

In [126]:
tasks+=1
pd.read_sql(
    '''   
WITH Ordered AS (
    SELECT NOX,
           ROW_NUMBER() OVER (ORDER BY NOX) AS rn,
           COUNT(*) OVER () AS cnt
    FROM boston
)
SELECT MIN(NOX) as MinValue,
       MAX(CASE WHEN rn IN (cnt/2, cnt/2 + 1, (cnt + 1)/2) THEN NOX END) as Median
FROM Ordered

 ''',
    con,
)

   MinValue  Median
0     0.385   0.538

4. Выведите разницу между среднем количеством комнат(RM) в домах с самой дорогой стоимостью(MEDV) и 25 самыми дешевыми домами. 
Аналогично по 50, 100, 200, 300 самыми дешевыми домами. (кол-во домов(25,50,100,200,300), среднее кол-во комнат в них, среднее кол-во комнат в самых дорогих, разница).
Напишите влияет ли кол-во комнат на стоимость и как сильно.

In [104]:
tasks+=1
pd.read_sql(
    '''

WITH Cheapest25 AS (
    SELECT AVG(RM) as AvgRoomsCheapest25
    FROM (
        SELECT RM
        FROM boston
        ORDER BY MEDV
        LIMIT 25
    )
),
MostExpensive AS (
    SELECT AVG(RM) as AvgRoomsMostExpensive
    FROM boston
    WHERE MEDV = (SELECT MAX(MEDV) FROM boston)
)
SELECT
    (SELECT AvgRoomsMostExpensive FROM MostExpensive) - (SELECT AvgRoomsCheapest25 FROM Cheapest25) as Difference,
    (SELECT AvgRoomsCheapest25 FROM Cheapest25) as AvgRoomsCheapest25,
    (SELECT AvgRoomsMostExpensive FROM MostExpensive) as AvgRoomsMostExpensive
    
   
       ''',
    con,
)

   Difference  AvgRoomsCheapest25  AvgRoomsMostExpensive
0     1.73616             5.74784                  7.484

In [107]:
tasks+=1
pd.read_sql(
    '''

WITH Cheapest50 AS (
    SELECT AVG(RM) as AvgRoomsCheapest50
    FROM (
        SELECT RM
        FROM boston
        ORDER BY MEDV
        LIMIT 50
    )
),
MostExpensive AS (
    SELECT AVG(RM) as AvgRoomsMostExpensive
    FROM boston
    WHERE MEDV = (SELECT MAX(MEDV) FROM boston)
)
SELECT
    (SELECT AvgRoomsMostExpensive FROM MostExpensive) - (SELECT AvgRoomsCheapest50 FROM Cheapest50) as Difference,
    (SELECT AvgRoomsCheapest50 FROM Cheapest50) as AvgRoomsCheapest50,
    (SELECT AvgRoomsMostExpensive FROM MostExpensive) as AvgRoomsMostExpensive
     
       ''',
    con,
)

   Difference  AvgRoomsCheapest50  AvgRoomsMostExpensive
0     1.73076             5.75324                  7.484

In [109]:
tasks+=1
pd.read_sql(
    '''

WITH Cheapest100 AS (
    SELECT AVG(RM) as AvgRoomsCheapest100
    FROM (
        SELECT RM
        FROM boston
        ORDER BY MEDV
        LIMIT 100
    )
),
MostExpensive AS (
    SELECT AVG(RM) as AvgRoomsMostExpensive
    FROM boston
    WHERE MEDV = (SELECT MAX(MEDV) FROM boston)
)
SELECT
    (SELECT AvgRoomsMostExpensive FROM MostExpensive) - (SELECT AvgRoomsCheapest100 FROM Cheapest100) as Difference,
    (SELECT AvgRoomsCheapest100 FROM Cheapest100) as AvgRoomsCheapest100,
    (SELECT AvgRoomsMostExpensive FROM MostExpensive) as AvgRoomsMostExpensive
     
       ''',
    con,
)

   Difference  AvgRoomsCheapest100  AvgRoomsMostExpensive
0     1.59688              5.88712                  7.484

In [111]:
tasks+=1
pd.read_sql(
    '''

WITH Cheapest200 AS (
    SELECT AVG(RM) as AvgRoomsCheapest200
    FROM (
        SELECT RM
        FROM boston
        ORDER BY MEDV
        LIMIT 200
    )
),
MostExpensive AS (
    SELECT AVG(RM) as AvgRoomsMostExpensive
    FROM boston
    WHERE MEDV = (SELECT MAX(MEDV) FROM boston)
)
SELECT
    (SELECT AvgRoomsMostExpensive FROM MostExpensive) - (SELECT AvgRoomsCheapest200 FROM Cheapest200) as Difference,
    (SELECT AvgRoomsCheapest200 FROM Cheapest200) as AvgRoomsCheapest200,
    (SELECT AvgRoomsMostExpensive FROM MostExpensive) as AvgRoomsMostExpensive
     
       ''',
    con,
)

   Difference  AvgRoomsCheapest200  AvgRoomsMostExpensive
0    1.572295             5.911705                  7.484

In [112]:
tasks+=1
pd.read_sql(
    '''

WITH Cheapest300 AS (
    SELECT AVG(RM) as AvgRoomsCheapest300
    FROM (
        SELECT RM
        FROM boston
        ORDER BY MEDV
        LIMIT 300
    )
),
MostExpensive AS (
    SELECT AVG(RM) as AvgRoomsMostExpensive
    FROM boston
    WHERE MEDV = (SELECT MAX(MEDV) FROM boston)
)
SELECT
    (SELECT AvgRoomsMostExpensive FROM MostExpensive) - (SELECT AvgRoomsCheapest300 FROM Cheapest300) as Difference,
    (SELECT AvgRoomsCheapest300 FROM Cheapest300) as AvgRoomsCheapest300,
    (SELECT AvgRoomsMostExpensive FROM MostExpensive) as AvgRoomsMostExpensive
     
       ''',
    con,
)

   Difference  AvgRoomsCheapest300  AvgRoomsMostExpensive
0    1.511773             5.972227                  7.484

In [ ]:
5.Выведите ранги значений колонки LSTAT(процент населения с более низким статусом) в домах с самой дорогой стоимостью (значение LSTAT, стоимость, ранг) среди всех значений LSTAT. Напишите какой вывод можно сделать по этим данным.

In [113]:
tasks+=1
pd.read_sql(
    '''
WITH RankedLSTAT AS (
    SELECT LSTAT, MEDV, RANK() OVER (ORDER BY LSTAT) as LSTAT_Rank
    FROM boston
)
SELECT LSTAT, MEDV, LSTAT_Rank
FROM RankedLSTAT
WHERE MEDV = (SELECT MAX(MEDV) FROM boston)

    ''',
    con,
)

    LSTAT  MEDV  LSTAT_Rank
0    1.73  50.0           1
1    1.92  50.0           2
2    2.88  50.0           6
3    2.96  50.0           8
4    2.97  50.0           9
5    3.16  50.0          15
6    3.26  50.0          17
7    3.32  50.0          18
8    3.70  50.0          26
9    3.73  50.0          27
10   4.45  50.0          41
11   4.63  50.0          50
12   5.12  50.0          67
13   7.44  50.0         141
14   8.88  50.0         181
15   9.53  50.0         203

6. Выведите среднюю стоимость домов граничащих с рекой(CHAS) и нет (граничит/не граничит, стоимость)

In [68]:
tasks+=1
pd.read_sql(
    '''
SELECT avg(MEDV) as avg_price,
case
WHEN CHAS = 0 THEN "не граничит"
WHEN CHAS = 1 THEN 'граничит'
END as CHAS
FROM boston
where CHAS = 1
union all
SELECT avg(MEDV) as avg_price,
case
WHEN CHAS = 0 THEN "не граничит"
WHEN CHAS = 1 THEN 'граничит'
END as CHAS
FROM boston
where CHAS = 0


    ''',
    con,
)

   avg_price         CHAS
0  28.440000     граничит
1  22.093843  не граничит




7. Выведите все колонки, у которых среднее значение выше, когда дом граничит с рекой (название колонки) выбирая из CRIM, ZN, INDUS, CHAS, NOX. Напишите какой вывод можно сделать по этим данным.

In [69]:
tasks+=1
pd.read_sql(
    '''
   SELECT
  'CRIM' AS avg_CRIM,
  AVG(CASE WHEN CHAS = 1 THEN CRIM ELSE NULL END) AS avg_river,
  AVG(CASE WHEN CHAS = 0 THEN CRIM ELSE NULL END) AS avg_no_river
FROM boston
HAVING avg_river > avg_no_river
UNION ALL
SELECT
  'ZN' AS avg_ZN,
  AVG(CASE WHEN CHAS = 1 THEN ZN ELSE NULL END) AS avg_river,
  AVG(CASE WHEN CHAS = 0 THEN ZN ELSE NULL END) AS avg_no_river
FROM boston
group by ZN
HAVING avg_river > avg_no_river
UNION ALL
SELECT
  'INDUS' AS avg_INDUS,
  AVG(CASE WHEN CHAS = 1 THEN INDUS ELSE NULL END) AS avg_river,
  AVG(CASE WHEN CHAS = 0 THEN INDUS ELSE NULL END) AS avg_no_river
FROM boston
HAVING avg_river > avg_no_river
UNION ALL
SELECT
  'NOX' AS avg_NOX,
  AVG(CASE WHEN CHAS = 1 THEN NOX ELSE NULL END) AS avg_river,
  AVG(CASE WHEN CHAS = 0 THEN NOX ELSE NULL END) AS avg_no_river
FROM boston
HAVING avg_river > avg_no_river;
    
    ''',
    con,
)

  avg_CRIM  avg_river  avg_no_river
0    INDUS  12.719143     11.019193
1      NOX   0.593426      0.551817

8. Выведите значения долей промышленной застройки(INDUS), концентрации оксидов азота(NOX) и по их перцентилям - 10, 20 ... 100 ( перцетиль(10,20...100),значение INDUS, значение NOX). Напишите прослеживается между ними взаимосвязь

In [47]:
tasks+=1
pd.read_sql(
    '''
WITH Percentiles AS (
  SELECT
    INDUS,
    NOX,
    NTILE(10) OVER (ORDER BY INDUS) AS IndusPercentile,
    NTILE(10) OVER (ORDER BY NOX) AS NoxPercentile
  FROM boston
)
SELECT
  DISTINCT IndusPercentile * 10 AS percentile,
  MAX(CASE WHEN IndusPercentile = NoxPercentile THEN INDUS END)
    OVER (PARTITION BY IndusPercentile) AS INDUS,
  MAX(CASE WHEN IndusPercentile = NoxPercentile THEN NOX END)
    OVER (PARTITION BY NoxPercentile) AS NOX
FROM Percentiles
ORDER BY percentile;



    ''',
    con,
)

#концентрация оксидов азота варируется 0,4 до 0,8 не зависимо от доли акров

    percentile  INDUS    NOX
0           10   2.68  0.422
1           10   2.68  0.442
2           10   2.68  0.453
3           10   2.68  0.507
4           10   2.68  0.538
5           20   4.39  0.422
6           20   4.39  0.442
7           20   4.39  0.453
8           20   4.39  0.507
9           20   4.39  0.538
10          20   4.39  0.573
11          20   4.39  0.671
12          30   5.13  0.422
13          30   5.13  0.442
14          30   5.13  0.453
15          30   5.13  0.507
16          30   5.13  0.538
17          40   7.38  0.422
18          40   7.38  0.442
19          40   7.38  0.453
20          40   7.38  0.507
21          40   7.38  0.538
22          50   8.56  0.507
23          50   8.56  0.538
24          50   8.56  0.573
25          50   8.56  0.597
26          60  13.89  0.422
27          60  13.89  0.442
28          60  13.89  0.507
29          60  13.89  0.573
30          60  13.89  0.597
31          70  18.10  0.442
32          70  18.10  0.453
33          70  18.10  0.538
34          70  18.10  0.573
35          70  18.10  0.597
36          70  18.10  0.671
37          80  18.10  0.671
38          80  18.10  0.713
39          90  18.10  0.597
40          90  18.10  0.713
41          90  18.10  0.871
42         100  19.58  0.597
43         100  19.58  0.671
44         100  19.58  0.871

CRIM - уровень преступности на душу населения
ZN - доля земель под жилую застройку зонирована под участки площадью более 25 000 кв. футов.
INDUS - доля акров неторгового бизнеса на город.
CHAS - 1, если граничит с рекой, 0 иначе
NOX - концентрация оксидов азота (частей на 10 миллионов)
RM - среднее количество комнат в квартире
AGE - доля жилых домов, построенных до 1940 г.
DIS - взвешенные расстояния до пяти центров занятости Бостона
RAD - индекс доступности к радиальным магистралям
TAX - полная ставка налога на имущество за 10 000 долларов США
PTRATIO - соотношение учеников и учителей по городам
B - 1000(Bk - 0.63)^2, где Bk доля чернокожих людей по городам
LSTAT - % более низкого статуса населения
MEDV - Средняя стоимость домов в 1000 долларов.

In [127]:
if tasks==8:
    print('Выполнены все задания 🙂')
else:
    print('Выполнены не все задания! 🙀')

Выполнены не все задания! 🙀